/**********************************************************************
作者：套套
邮箱：2011543651@qq.com
功能：用于演示STC15使用tiny51系统的例子
		使用keil官方的Tiny用串口函数进行串口命令读取并回显

**********************************************************************/
#include <rtx51tny.h>
#include <config.H>
#include <stdio.h>
#include <usar.h>

#define os_enter_critical() ET0=0
#define os_exit_critical() 	ET0=1

uchar inline[16] = "JKLJK";


/**********************************************************************
	第一个任务，用于初始化。
**********************************************************************/
void Init() _task_ 0  {                  
	os_create_task (1);		  //创建第一个任务	
	os_create_task (2);		  //创建第二个任务		
	UartInit();			  	  //进行串口的初始化	

	os_delete_task (0);		  //初始化完毕，删除自身任务
}

/**********************************************************************
	第二个任务，使用keil官方的Tiny用串口函数进行串口命令读取并回显
**********************************************************************/
void LED1() _task_ 1{
	while (1)  {
		printf ("\nCommand: ");
	 	getline (&inline, sizeof (inline));	//此处读取串口会自动调用putchar进行回显
												//注意，请勿在printf中调用inline，会造成资源冲突
		printf ("getData");
	}
}


//void main(){
//	Timer1Init();
//	EA = 1;
//	while(1){
//		;
//	}
//}