/**********************************************************************
×÷Õß£ºÌ×Ì×
ÓÊÏä£º2011543651@qq.com
¹¦ÄÜ£ºÓÃÓÚÑİÊ¾STC15Ê¹ÓÃtiny51ÏµÍ³µÄÀı×Ó
		Ê¹ÓÃkeil¹Ù·½µÄTinyÓÃ´®¿Úº¯Êı½øĞĞ´®¿ÚÃüÁî¶ÁÈ¡²¢»ØÏÔ

**********************************************************************/
#include <rtx51tny.h>
#include <config.H>
#include <stdio.h>
#include <12864.h>
#include <delay.h>
#include <pid.h>

#define os_enter_critical() ET0=0
#define os_exit_critical() 	ET0=1

char temp[8];
uchar flag = 1;

/**********************************************************************
	µÚÒ»¸öÈÎÎñ£¬ÓÃÓÚ³õÊ¼»¯¡£
**********************************************************************/
void Init() _task_ 0  {
	P0M1=0;P0M0=0;P1M1=0;P1M0=0;
	P2M1=0;P2M0=0;P3M1=0;P3M0=0;
	P4M1=0;P4M0=0;P5M1=0;P5M0=0;
	                  		
	Lcd_init();
	Lcd_str(0, 0, "1 OFF!");
	Lcd_str(1, 0, "2 OFF!");
	os_create_task (1);		  //´´½¨µÚÒ»¸öÈÎÎñ	
	os_create_task (2);		  //´´½¨µÚ¶ş¸öÈÎÎñ
	os_delete_task (0);		  //³õÊ¼»¯Íê±Ï£¬É¾³ı×ÔÉíÈÎÎñ
}

///**********************************************************************
//	µÚ¶ş¸öÈÎÎñ£¬Ê¹ÓÃ°´¼üÇı¶¯ÆÁÄ»ÏÔÊ¾
//**********************************************************************/
void LED1() _task_ 1{
	while (1)  {
		if(P23 == 0){
			os_wait2 (K_TMO, 1);
			if(P23 == 0){
				os_send_signal (2);	
				os_send_signal (3);
			}
			while(!P23);
		}
		if(P24 == 0){
			os_wait2 (K_TMO, 1);
			if(P24 == 0){
				
			}
			while(!P24);
		}
	}
}

/**********************************************************************
	µÚÈı¸öÈÎÎñ£¬Ê¹ÓÃ12864½øĞĞÇı¶¯ÏÔÊ¾°´¼ü°´ÏÂÁË°´¼ü1
**********************************************************************/
void LCD1() _task_ 2{
	int i;
	while(1){
		os_wait2 (K_SIG, 0);
		Lcd_str(0, 0, "PID Start!  ");
		while(flag == 1){
			PID_M2_PosLocCalc(0.1230);
			sprintf(temp, "PIDnum:%d!", i);
		 	Lcd_str(0, 0, temp);				//ÏÔÊ¾ÄÚİ
			i++;
		}
		sprintf(temp, "PIDnum:%d!", i);
	 	Lcd_str(0, 0, temp);				//ÏÔÊ¾ÄÚÈİ
		P11 = ~P11;
	}
}

/**********************************************************************
	µÚÈı¸öÈÎÎñ£¬Ê¹ÓÃ12864½øĞĞÇı¶¯ÏÔÊ¾°´¼ü°´ÏÂÁË°´¼ü1
**********************************************************************/
void FLAG1() _task_ 3{
	while(1){
		os_wait2 (K_TMO, 1000);
		flag = 0;
	}
}


//void main(){
//	Timer1Init();
//	EA = 1;
//	while(1){
//		;
//	}
//}